
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Состояние(НСтр("en='Creating new document ...';ru='Создание нового документа...'"));
	
	ДанныеЗаполнения=Новый Структура("НаименованиеДокумента", "Новый 1");
	ПараметрыФормы=Новый Структура("Основание,ЗаполнитьКакНовый", ДанныеЗаполнения,Истина);
	
	//ВладелецФормы=ПараметрыВыполненияКоманды.Источник;
	//ОкноФормы=ПараметрыВыполненияКоманды.Окно;
	
	Попытка
		ОткрытьФорму("Документ.аДокументооборотКорпоративныйДокумент.Форма.ФормаДокументаЗаявкаНаОплату"); 
	Исключение
		аДООбщееКлиент.СообщитьОбОшибке(ОписаниеОшибки());
	КонецПопытки;

	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("ОбщаяФорма.", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
 

&НаСервере
Процедура Команда3НаСервере(ВидДокумента)
	ВидДокумента = Справочники.аДокументооборотВидыДокументов.НайтиПоНаименованию("Заявка на оплату");
КонецПроцедуры

&НаКлиенте
Процедура Команда3(Команда)
	
//	pcru_РаботаСДокументами.;
	
	ДанныеЗаполнения=Новый Структура("НаименованиеДокумента", "Новый 1");
	ВидДокумента = Неопределено;
	Команда3НаСервере(ВидДокумента);
	ДанныеЗаполнения.Вставить("ВидДокумента",ВидДокумента);
	ПараметрыФормы=Новый Структура("ЗначенияЗаполнения", ДанныеЗаполнения);
	
	               

	
		ОткрытьФорму("Документ.аДокументооборотКорпоративныйДокумент.Форма.ФормаДокумента",ПараметрыФормы);

	  //    ПолучитьФорму
	
	
КонецПроцедуры
