
&НаКлиенте
Процедура Pcru_ПриЗакрытииВместо(ЗавершениеРаботы)
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли; 
	
	
	Если Элементы.ДеревоПапок.ТекущиеДанные<>Неопределено Тогда
		ЗначениеОтбораПоДереву=Элементы.ДеревоПапок.ТекущиеДанные.Папка;
	Иначе
		ЗначениеОтбораПоДереву=Неопределено;
	КонецЕсли;
	
	ЗаписатьНастройкиСервером(ЗначениеОтбораПоДереву);
	
	
КонецПроцедуры

&НаСервере
&Вместо("УстановитьТекстЗапросаПоСтруктуреОтборов")
Функция Pcru_УстановитьТекстЗапросаПоСтруктуреОтборов(СтруктураОтборов)
	//проверим, нет ли в структуре отбора работающего по критерию отбора (потребуется другой текст запроса)
	НазваниеКритерияОтбора="";
	Для Каждого ЭлементСтруктуры Из СтруктураОтборов Цикл
		ИмяОтбора=ЭлементСтруктуры.Ключ;
		Если Найти(ИмяОтбора, "Критерий")>0 Тогда
			НазваниеКритерияОтбора=СтрЗаменить(ИмяОтбора, "Критерий", "");
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НазваниеКритерияОтбора="" Тогда
		//обычный запрос
		ТекстЗапроса="ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Документ.Ссылка КАК Ссылка,
		|	Документ.ПометкаУдаления КАК ПометкаУдаления,
		|	Документ.Номер КАК Номер,
		|	Документ.РегистрационныйНомер КАК РегистрационныйНомер,
		|	Документ.ДатаРегистрации КАК ДатаРегистрации,
		|	Документ.ТипДокумента КАК ТипДокумента,
		|	Документ.Дата КАК Дата,
		|	Документ.Проведен КАК Проведен,
		|	Документ.Автор КАК Автор,
		|	Документ.ВажностьДокумента КАК ВажностьДокумента,
		|	Документ.ВидДокумента КАК ВидДокумента,
		|	Документ.НаименованиеДокумента КАК НаименованиеДокумента,
		|	Документ.ОсновнойКонтрагент КАК ОсновнойКонтрагент,
		|	Документ.ОсновнаяОрганизация КАК ОсновнаяОрганизация,
		|	Документ.ОсновноеПодразделение КАК ОсновноеПодразделение,
		|	Документ.ОсновнойПроект КАК ОсновнойПроект,
		|	Документ.ОсновноеКонтактноеЛицоКонтрагента КАК ОсновноеКонтактноеЛицоКонтрагента,
		|	Документ.СуммаДокумента КАК СуммаДокумента,
		|	Документ.Комментарий КАК Комментарий,
		|	Pcru_ТекущийИсполнительПоДокументу.ТекущийИсполнитель КАК ТекущийИсполнитель,
		|	аДокументооборотСостояниеДокументов.СостояниеДокумента КАК СостояниеДокумента
		|ИЗ
		|	Документ.аДокументооборотКорпоративныйДокумент КАК Документ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.аДокументооборотСостояниеДокументов КАК аДокументооборотСостояниеДокументов
		|		ПО (аДокументооборотСостояниеДокументов.КорпоративныйДокумент = Документ.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Pcru_ТекущийИсполнительПоДокументу КАК Pcru_ТекущийИсполнительПоДокументу
		|		ПО (Pcru_ТекущийИсполнительПоДокументу.КорпоративныйДокумент = Документ.Ссылка)
		|ГДЕ";
		//ИначеЕсли НазваниеКритерияОтбора="РабочиеГруппы" Тогда
		//	//нестандартный критерий, отбор будет по пользователям входящим в рабочие группы
	Иначе
		//простой запрос по критерию
		ТекстЗапроса="ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Документ.Ссылка КАК Ссылка,
		|	Документ.ПометкаУдаления КАК ПометкаУдаления,
		|	Документ.Номер КАК Номер,
		|	Документ.РегистрационныйНомер КАК РегистрационныйНомер,
		|	Документ.ДатаРегистрации КАК ДатаРегистрации,
		|	Документ.ТипДокумента КАК ТипДокумента,
		|	Документ.Дата КАК Дата,
		|	Документ.Проведен КАК Проведен,
		|	Документ.Автор КАК Автор,
		|	Документ.ВажностьДокумента КАК ВажностьДокумента,
		|	Документ.ВидДокумента КАК ВидДокумента,
		|	Документ.НаименованиеДокумента КАК НаименованиеДокумента,
		|	Документ.ОсновнойКонтрагент КАК ОсновнойКонтрагент,
		|	Документ.ОсновнаяОрганизация КАК ОсновнаяОрганизация,
		|	Документ.ОсновноеПодразделение КАК ОсновноеПодразделение,
		|	Документ.ОсновнойПроект КАК ОсновнойПроект,
		|	Документ.ОсновноеКонтактноеЛицоКонтрагента КАК ОсновноеКонтактноеЛицоКонтрагента,
		|	Документ.СуммаДокумента КАК СуммаДокумента,
		|	Документ.Комментарий КАК Комментарий,
		|	Документ.СотрудникРегистратор КАК СотрудникРегистратор,
		|	аДокументооборотСостояниеДокументов.СостояниеДокумента КАК СостояниеДокумента
		|ИЗ
		|	КритерийОтбора."+НазваниеКритерияОтбора+"(&ЗначениеКритерияОтбора) КАК ТаблицаКритерия
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.аДокументооборотКорпоративныйДокумент КАК Документ
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.аДокументооборотСостояниеДокументов КАК аДокументооборотСостояниеДокументов
		|			ПО (аДокументооборотСостояниеДокументов.КорпоративныйДокумент = Документ.Ссылка)
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Pcru_ТекущийИсполнительПоДокументу КАК Pcru_ТекущийИсполнительПоДокументу
		|			ПО Документ.Ссылка = Pcru_ТекущийИсполнительПоДокументу.КорпоративныйДокумент
		|		ПО ТаблицаКритерия.Ссылка = Документ.Ссылка
		|ГДЕ";
		
	КонецЕсли;	
	
	ПервоеУсловие=Истина;
	Для Каждого ЭлементСтруктуры Из СтруктураОтборов Цикл 
		ИмяОтбора=ЭлементСтруктуры.Ключ;
		Если ИмяОтбора="ДатаРегистрации" Тогда
			Продолжить;
		КонецЕсли;
		
		Если Найти(ИмяОтбора, "Критерий")>0 Тогда
			Продолжить; //используется в критерии, а не в условии ГДЕ
		КонецЕсли;
		
		ЗначениеОтбора=ЭлементСтруктуры.Значение;
		
		Если НЕ ПервоеУсловие Тогда
			Если ИмяОтбора<>"СостояниеДокумента" Тогда
				ТекстЗапроса=ТекстЗапроса+" И Документ."+ИмяОтбора+"=&"+ИмяОтбора;
			Иначе
				ТекстЗапроса=ТекстЗапроса+" И аДокументооборотСостояниеДокументов."+ИмяОтбора+"=&"+ИмяОтбора;
			КонецЕсли;
		Иначе			
			Если ИмяОтбора<>"СостояниеДокумента" Тогда
				ТекстЗапроса=ТекстЗапроса+"   Документ."+ИмяОтбора+"=&"+ИмяОтбора;
			Иначе
				ТекстЗапроса=ТекстЗапроса+"   аДокументооборотСостояниеДокументов."+ИмяОтбора+"=&"+ИмяОтбора;
			КонецЕсли;
			ПервоеУсловие=Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Прав(ТекстЗапроса, 3)="ГДЕ" Тогда
		ТекстЗапроса=Сред(ТекстЗапроса, 0, СтрДлина(ТекстЗапроса)-3);
	КонецЕсли;
	
	Попытка
		Если Список.ТекстЗапроса<>ТекстЗапроса Тогда
			Список.ТекстЗапроса=ТекстЗапроса;
		КонецЕсли;
	Исключение
		аДООбщееСервер.СообщитьОбОшибке(ОписаниеОшибки());
	КонецПопытки;	
	
КонецФункции
