
&После("ОбработкаПолученияФормы")
Процедура Pcru_ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	Если ВидФормы = "ФормаОбъекта" Тогда
		НаименованиеВида =  "";
		Если Параметры.Свойство("ЗначениеКопирования") Тогда
			НаименованиеВида =  Параметры.ЗначениеКопирования.ВидДокумента.Наименование;
		КонецЕсли; 
		Если Параметры.Свойство("Ключ") Тогда
			НаименованиеВида =  Параметры.Ключ.ВидДокумента.Наименование;
		КонецЕсли; 
		Если НаименованиеВида = "Заявка на оплату" Тогда
			ВыбраннаяФорма = "Документ.аДокументооборотКорпоративныйДокумент.Форма.ФормаДокументаЗаявкаНаОплату";  
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
		
		Если НаименованиеВида = "Список задач для Глав Отделов" Тогда
			ВыбраннаяФорма = "Документ.аДокументооборотКорпоративныйДокумент.Форма.ФормаДокументаПоручение"; 
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
		
		Если НаименованиеВида = "Входящий" Тогда
			ВыбраннаяФорма = "Документ.аДокументооборотКорпоративныйДокумент.Форма.ФормаДокументаВходящий"; 
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	//
	Если ВидФормы = "ФормаСписка" Тогда
		Если РольДоступна("ПолныеПрава") или РольДоступна("pcru_HD") Тогда
			ВыбраннаяФорма = "Документ.аДокументооборотКорпоративныйДокумент.Форма.ФормаНавигатор"; 
			СтандартнаяОбработка = Ложь;
		КонецЕсли; 	
	КонецЕсли;
КонецПроцедуры
