
&Вместо("УдалитьСсылку")
Функция Pcru_УдалитьСсылку(ПараметрыВыполнения, Ссылка)
	Результат = Новый Структура;
	Результат.Вставить("Успех", Ложь);
	Результат.Вставить("ИнформацияОбОшибке", "");
	Результат.Вставить("ПрепятствующиеУдалению", Новый ТаблицаЗначений);
	Результат.Вставить("ВложенныеИПодчиненныеОбъекты", Новый Массив);
	Результат.Вставить("Количество", 0);
		
	Попытка
		//		НачатьТранзакцию();
		Объект = Ссылка.ПолучитьОбъект();
		Объект.Удалить();
		//		ЗафиксироватьТранзакцию();
		Результат.Вставить("Успех", Истина);
	Исключение
		ОО=ОписаниеОшибки();
		Сообщить(ОО);
		Результат.Вставить("Успех", Ложь);
		Результат.Вставить("ИнформацияОбОшибке", ОО);
		//		ОтменитьТранзакцию();
	КонецПопытки;
	
	//Если ТипЗнч(Результат.ПрепятствующиеУдалению) = Тип("ТаблицаЗначений") Тогда
	//	Результат.ПрепятствующиеУдалению.Колонки[0].Имя = "УдаляемыйСсылка";
	//	Результат.ПрепятствующиеУдалению.Колонки[1].Имя = "ОбнаруженныйСсылка";
	//	Результат.ПрепятствующиеУдалению.Колонки[2].Имя = "ОбнаруженныйМетаданные";
	//	Для Каждого ОбнаруженныйСсылка Из Результат.ВложенныеИПодчиненныеОбъекты Цикл
	//		СтрокаТаблицы = Результат.ПрепятствующиеУдалению.Добавить();
	//		СтрокаТаблицы.УдаляемыйСсылка        = Ссылка;
	//		СтрокаТаблицы.ОбнаруженныйСсылка     = ОбнаруженныйСсылка;
	//	КонецЦикла;
	//КонецЕсли;
	//
	Возврат Результат;
КонецФункции
