Процедура НастройкиНачальнойСтраницы (ИменаПараметровСеанса)
//Если ИменаПараметровСеанса = Неопределено Тогда
// Для примера будем менять настройки пользователя "не глядя" на то, что он себе настроил.
НастройкиНачальнойСтраницы = Новый НастройкиНачальнойСтраницы;
Составформ = Новый СоставформНачальнойСтраницы;
// Если это этап начала работы с программой, показывать только список поступлений товаров
Составформ. ЛеваяКолонка. Добавить ("Документ. ПриходТовара. Форма. ФормаСписка") ;
// Иначе, если этап ознакомления с программой завершён, показывать полную начальную страницу
//
Составформ. ЛеваяКолонка. Добавить ("Документ. ПриходТовара. Форма. ФормаСписка") ;
Составформ. ЛеваяКолонка. Добавить ("Обработка. ЭлектроннаяПочта. Форма. Форма");
Составформ. ПраваяКолонка. Добавить ("РегистрНакопления. Взаиморасчеты. Форма. ТекущиеВзаиморасчеты");
Составформ. ПраваяКолонка. Добавить ("РегистрСведений. КурсыВалют. Форма. ТекущиеКурсыВалют");
// Конец проверок
НастройкиНачальнойСтраницы. Установитьсоставформ (Составформ) ;
// Положить объект настроек текущему пользователю в хранилище.
ХранилищеСистемныхНастроек. Сохранить ("Общее/НастройкиНачальнойСтраницы", НастройкиНачальнойСтраницы) ;
// Если же хотим менять настройки, которые установил пользователь себе,
// тогда нужно прочитать его настройки из хранилища, и выполнить метод ПолучитьСоставФорм() .
//НастройкиНачальнойСтраницы Хранилище СистемныхНастроек. Загрузить ("Общее/НастройкиНачальнойСтраницы") ;
//Составформ = НастройкиНачальнойСтраницы. ПолучитьСоставформ() ;
//11
//изменить состав форм
//НастройкиНачальнойСтраницы. УстановитьСоставформ (Составформ) ;
//ХранилищеСистемныхНастроек. Сохранить ("Общее/НастройкиНачальнойСтраницы" НастройкиНачальнойстраницы) ;
// Если же хотим менять настройки, установленные в конфигураторе,
// нужно создать НастройкиНачальнойСтраницы конструктором и получить состав форм.
//НастройкиНачальнойСтраницы = Новый НастройкиНачальнойСтраницы;
//Составформ = НастройкиНачальнойСтраницы. Получить () ;
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы(Отказ)
	//
	//// Определить размеры экрана.
	//Экраны = ПолучитьИнформациюЭкрановКлиента();
	//
	//// Для примера допускаем, что экран один.
	//// Но если экранов несколько, нужно анализировать их все.
	//ВысотаЭкрана = Экраны[0].Высота;
	//ШиринаЭкрана = Экраны[0].Ширина;
	//
	//// Если экран маленький, включить только панель инструментов.
	//// Если ... 
	//	НастройкаИнтерфейса.ВыполнитьНастройкуПанелей();
	//// КонецЕсли;
	//
	//ОбновитьИнтерфейс();
	
КонецПроцедуры

Процедура НастройкаПанелей() Экспорт
	
	// Для примера будем менять настройки пользователя "не глядя" на то, что он себе настроил.
	// Создать пустой объект настроек.
	НастройкиИнтерфейса = Новый НастройкиИнтерфейсаКлиентскогоПриложения;
	
	// С помощью пустого объекта настроек получить настройки состава, установленные в конфигураторе.
	НастройкиСостава = НастройкиИнтерфейса.ПолучитьСостав();
	
	// Очистить настройки состава.
	НастройкиСостава.Верх.Очистить();
	НастройкиСостава.Лево.Очистить();
	НастройкиСостава.Низ.Очистить();
	НастройкиСостава.Право.Очистить();
	
	// Заполнить своими панелями.
	// Для примера самый простой вариант: слева - панель инструментов.
	ПанельИнструментов = Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельИнструментов");
	НастройкиСостава.Лево.Добавить(ПанельИнструментов);
	
	// Загрузить настройки состава в пустой объект настроек.
	НастройкиИнтерфейса.УстановитьСостав(НастройкиСостава);
	
	// Положить объект настроек текущему пользователю в хранилище.
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения", , НастройкиИнтерфейса);

	// Если же хотим менять настройки, которые установил пользователь себе, 
	// тогда нужно прочитать его настройки из хранилища, и метод ПолучитьСостав()
	// вернёт не то, что в конфигураторе, а то, что пользователь установил себе.
	//
	// НастройкиИнтерфейса = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения");
	// НастройкиСостава = НастройкиИнтерфейса.ПолучитьСостав();	
	// ... изменть настройки состава
	// НастройкиИнтерфейса.УстановитьСостав(НастройкиСостава);
	// ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения", , НастройкиИнтерфейса);
	
КонецПроцедуры
