
&Вместо("ПередЗавершениемРаботыСистемы")
Процедура Pcru_ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПередЗавершениемРаботыСистемы(Отказ);
	// Конец СтандартныеПодсистемы
	
	ТекстПредупреждения = НСтр("ru = 'Завершить работу с программой?'");
	Отказ = Истина;

	//ПодключитьОбработчикОжидания("Pcru_ПередЗавершениемРаботыСистемыПодключаемая",0.5,Истина);
	
КонецПроцедуры

//// Эта процедура делает серверные вызовы в обход ограничения.
//Процедура Pcru_ПередЗавершениемРаботыСистемыПодключаемая() Экспорт
//	Отказ =  Ложь;
//	аДООбщееКлиент.ПередЗавершениемРаботыСистемы(Отказ);//analitica.ru
//	pcru_РаботаСДокументами.ЗакрытьВсеФайлы();//PCRU_MF!
//	
//	Если Не Отказ Тогда
//		ЗавершитьРаботуСистемы(Ложь);
//	КонецЕсли;
//КонецПроцедуры

&После("ПриНачалеРаботыСистемы")
Процедура Pcru_ПриНачалеРаботыСистемы()
	
	pcru_РаботаСДокументами.ЗакрытьВсеФайлы();
КонецПроцедуры