
&После("УстановкаПараметровСеанса")
Процедура Pcru_УстановкаПараметровСеанса(ИменаПараметровСеанса)
	
	//Возврат;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПодразделенияСотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Подразделения.Сотрудники КАК ПодразделенияСотрудники
	|ГДЕ
	|	ПодразделенияСотрудники.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь",ПараметрыСеанса.ТекущийПользователь );
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПараметрыСеанса.Pcru_ТекущееПдразделение = Выборка.ссылка;
	КонецЦикла;
	
КонецПроцедуры
