
Функция ПолучитьМаксимальныйНомерСтроки(Документ) Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	pcru_ПорученияГлавамОтделов.НомерСтрокиДокумента КАК НомерСтроки
	|ИЗ
	|	РегистрСведений.pcru_ПорученияГлавамОтделов КАК pcru_ПорученияГлавамОтделов
	|ГДЕ
	|	pcru_ПорученияГлавамОтделов.Документ = &Документ
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки УБЫВ";
	
	Запрос.УстановитьПараметр("Документ",Документ.ссылка );
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ЕСли Выборка.Следующий() Тогда
		Возврат Выборка.НомерСтроки +1;
	Иначе	
		Возврат 1;
	КонецЕсли;
	
	
	
КонецФункции // ПолучитьМаксимальныйНомерСтроки()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ОчиститьПоДокументу(Документ) Экспорт
	
	
	НЗ = РегистрыСведений.pcru_ПорученияГлавамОтделов.СоздатьНаборЗаписей();
	НЗ.Отбор.Документ.Установить(Документ.ссылка);
	НЗ.Прочитать();
	НЗ.Очистить();
	Нз.Записать();
	
	
	
	
	
КонецПроцедуры // ОчиститьПоДокументу()


//КурсыВалют = РегистрыСведений.КурсыВалют;
//НаборКурсов = КурсыВалют.СоздатьНаборЗаписей();
//Доллар = Справочники.Валюты.НайтиПоНаименованию("USD");
//НаборКурсов.Отбор.Валюта.Установить(Доллар);
//НаборКурсов.Отбор.Период.Установить(НачалоДня(ТекущаяДата()));
//НаборКурсов.Прочитать();
//Если НаборКурсов.Количество() = 0 Тогда
//    НовыйКурс = НаборКурсов.Добавить();
//    НовыйКурс.Валюта = Доллар;
//    НовыйКурс.Период = ТекущаяДата();
//ИначеЕсли НаборКурсов.Количество() = 1 Тогда
//    НовыйКурс = НаборКурсов[0];
//Иначе
//    Предупреждение(НСтр("ru = 'Курс валюты задается один раз в день.';"
//     + " en = 'Rate is set once a day.'"), 60);
//    Возврат;
//КонецЕсли;
//НовыйКурс.Курс = 31.44;
//НовыйКурс.Кратность = 1;
//НаборКурсов.Записать();
//Сообщить(НСтр(ru = 'Курс '; en = 'Rate ') 
//    + СокрЛП(НовыйКурс.Валюта) 
//    + НСтр(ru = ' на сегодня: "+"; en = ' for today: ') 
//    + НовыйКурс.Курс + НСтр(ru = ' руб.'; en = ' roub.'"));