
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Состояние(НСтр("en='Creating new document ...';ru='Создание нового документа...'"));
	
	//ДанныеЗаполнения=Новый Структура("НаименованиеДокумента", "Новый 1");
	//ПараметрыФормы=Новый Структура("Основание", ДанныеЗаполнения);
	
	//ВладелецФормы=ПараметрыВыполненияКоманды.Источник;
	//ОкноФормы=ПараметрыВыполненияКоманды.Окно;
	
	Попытка
		ОткрытьФорму("Документ.аДокументооборотКорпоративныйДокумент.Форма.ФормаДокументаВходящий"); 
	Исключение
		аДООбщееКлиент.СообщитьОбОшибке(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры
