
&НаКлиенте
Процедура ДобавитьВыполнить()
	
	Если ПустаяСтрока(Строка(Ссылка)) Тогда //analitica.ru
		Возврат;
	КонецЕсли;
	
	Ссылки = Новый Массив;
	Ссылки.Добавить(Ссылка);
	ПредставленияСсылок = ПолучитьПредставленияНавигационныхСсылок(Ссылки);
	Если ПредставленияСсылок.Количество() <> 0 Тогда
		Закрыть(КодВозвратаДиалога.ОК);
		Возврат;
	КонецЕсли;	
	
	ПоказатьПредупреждение(Неопределено, НСтр("en='Link ""';ru='Ссылку ""'") + Ссылка + НСтр("ru='"" нельзя добавить в список, т.к. она указана неправильно.';"));
	
КонецПроцедуры
