
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Состояние(НСтр("en='Creating new document ...';ru='Создание нового документа...'"));
	
	ДанныеЗаполнения=Новый Структура("НаименованиеДокумента", "Новый 1");
	ПараметрыФормы=Новый Структура("Основание,ЗаполнитьКакНовый", ДанныеЗаполнения,Истина);
	
	//ВладелецФормы=ПараметрыВыполненияКоманды.Источник;
	//ОкноФормы=ПараметрыВыполненияКоманды.Окно;
	
	Попытка
		ОткрытьФорму("Документ.аДокументооборотКорпоративныйДокумент.Форма.ФормаДокументаЗаявкаНаОплату"); 
	Исключение
		аДООбщееКлиент.СообщитьОбОшибке(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервере
Функция СоздатьНовыйЗНО()

	  НовДок = Документы.аДокументооборотКорпоративныйДокумент.СоздатьДокумент();
	  НовДок.ВидДокумента = Справочники.аДокументооборотВидыДокументов.НайтиПоНаименованию("Заявка на оплату");

	  НовДок.Дата = ТекущаяДата();
	    Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ПодразделенияСотрудники.Ссылка
		|ИЗ
		|	Справочник.Подразделения.Сотрудники КАК ПодразделенияСотрудники
		|ГДЕ
		|	ПодразделенияСотрудники.Пользователь = &Пользователь";
		Запрос.УстановитьПараметр("Пользователь",ПараметрыСеанса.ТекущийПользователь.Ссылка);
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			  Нстр = НовДок.ОрганизацииПодразделения.Добавить();
              Нстр.Подразделение =  Выборка.Ссылка;
		КонецЦикла;
		НовДок.Записать();
		Возврат НовДок.Ссылка;
КонецФункции // СоздатьНовыйЗНО()
 
