
&После("ПриЗаписи")
Процедура Pcru_ПриЗаписи(Отказ, Замещение)
		Для каждого СтрокаНЗ Из ЭтотОбъект Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	аДокументооборотСсылкиПроцессов.Объект
		|ИЗ
		|	РегистрСведений.аДокументооборотСсылкиПроцессов КАК аДокументооборотСсылкиПроцессов
		|ГДЕ
		|	аДокументооборотСсылкиПроцессов.БизнесПроцесс = &БизнесПроцесс";
		Запрос.УстановитьПараметр("БизнесПроцесс",СтрокаНЗ.БизнесПроцесс);
		Выборка = Запрос.Выполнить().Выбрать();
		СписокОбъектов = Новый  СписокЗначений;
		Пока Выборка.Следующий() Цикл
			СписокОбъектов.Добавить(Выборка.Объект);
			
			
			
			
			
		КонецЦикла;
		//
		Если СписокОбъектов.Количество() =0 Тогда
			Продолжить;
		КонецЕсли; 		
		//
		Попытка
			НЗ = РегистрыСведений.pcru_ЗадачиПоДокументам.СоздатьНаборЗаписей();
			НЗ.Отбор.Документ.Установить(СписокОбъектов[0].Значение, Истина);
			НЗ.Отбор.БизнесПроцесс.Установить(СтрокаНЗ.БизнесПроцесс, Истина);
			НЗ.Отбор.Исполнитель.Установить(СтрокаНЗ.ИсходныйИсполнитель, Истина);
			НЗ.Прочитать();
		Исключение
			Продолжить;	
		КонецПопытки;
		//
		
		НЗ.Очистить();
		//Если НЗ.Количество() = 0 Тогда
			
			Запись = Нз.Добавить();	
			//
			Запись.БизнесПроцесс =  СтрокаНЗ.БизнесПроцесс;
			Запись.Документ = СписокОбъектов[0].Значение;
			Запись.Исполнитель = СтрокаНЗ.ИсходныйИсполнитель;
			Запись.Инициатор   =  СтрокаНЗ.БизнесПроцесс.Автор;
			Запись.Порядок = 99;
			Запись.Переадресант  = СтрокаНЗ.ДействующийИсполнитель;
			Запрос1 = Новый Запрос;
			Запрос1.Текст = "ВЫБРАТЬ
			|	аДокументооборотМатрицаЗаместителейСрезПоследних.ПричинаЗамены
			|ИЗ
			|	РегистрСведений.аДокументооборотМатрицаЗаместителей.СрезПоследних КАК аДокументооборотМатрицаЗаместителейСрезПоследних
			|ГДЕ
			|	аДокументооборотМатрицаЗаместителейСрезПоследних.ЗамещаемыйСотрудник = &ЗамещаемыйСотрудник
			|	И аДокументооборотМатрицаЗаместителейСрезПоследних.ДатаОкончания >= &ТекДата
			|	И аДокументооборотМатрицаЗаместителейСрезПоследних.Период <= &ТекДата";
			Запрос1.УстановитьПараметр("ЗамещаемыйСотрудник",СтрокаНЗ.ИсходныйИсполнитель);
			Запрос1.УстановитьПараметр("ТекДата",ТекущаяДата());
			Выборка1 = Запрос1.Выполнить().Выбрать();
			Если Выборка1.Следующий()  Тогда
				Запись.Согласовано =  Выборка1.ПричинаЗамены ;
				Запись.ТекстовыйРезультат =   "Заместитель " + СтрокаНЗ.ДействующийИсполнитель;
				Запись.ПричинаПереадресации  =  Выборка1.ПричинаЗамены;
			Иначе
				Запись.Согласовано =  "Переадресовано";
				Запись.ТекстовыйРезультат =   СтрокаНЗ.ДействующийИсполнитель;
				Запись.ПричинаПереадресации  =  "Перенаправлено исполнителем " + СтрокаНЗ.ИсходныйИсполнитель;
			КонецЕсли;
		//	Запись = Нз.Добавить();	
			//
			
			Запись =  РегистрыСведений.pcru_ЗадачиПоДокументам.СоздатьМенеджерЗаписи();
			
			Запись.БизнесПроцесс =  СтрокаНЗ.БизнесПроцесс;
			Запись.Документ = СписокОбъектов[0].Значение;
			Запись.Исполнитель = СтрокаНЗ.ДействующийИсполнитель;
			Запись.Инициатор   =  СтрокаНЗ.БизнесПроцесс.Автор;
			Запись.Порядок = 99;
			Запись.Переадресант  = Неопределено;
			Запись.Согласовано =  "Не выдана" ;
			Запись.ТекстовыйРезультат =   "Не выдана";
			Запись.ПричинаПереадресации  = "Не выдана";
			Запись.Записать(Истина);
			//Иначе
		//	Для каждого Запись Из НЗ Цикл
		//		Запись.БизнесПроцесс =  СтрокаНЗ.БизнесПроцесс;
		//		Запись.Документ = СписокОбъектов[0].Значение;
		//		Запись.Исполнитель = СтрокаНЗ.ИсходныйИсполнитель;
		//		Запись.Инициатор   =  СтрокаНЗ.БизнесПроцесс.Автор;
		//		Запись.Порядок = 99;
		//		Запись.Переадресант  = СтрокаНЗ.ДействующийИсполнитель;
		//		Запрос1 = Новый Запрос;
		//		Запрос1.Текст = "ВЫБРАТЬ
		//		|	аДокументооборотМатрицаЗаместителейСрезПоследних.ПричинаЗамены
		//		|ИЗ
		//		|	РегистрСведений.аДокументооборотМатрицаЗаместителей.СрезПоследних КАК аДокументооборотМатрицаЗаместителейСрезПоследних
		//		|ГДЕ
		//		|	аДокументооборотМатрицаЗаместителейСрезПоследних.ЗамещаемыйСотрудник = &ЗамещаемыйСотрудник
		//		|	И аДокументооборотМатрицаЗаместителейСрезПоследних.ДатаОкончания >= &ТекДата
		//		|	И аДокументооборотМатрицаЗаместителейСрезПоследних.Период <= &ТекДата";
		//		Запрос1.УстановитьПараметр("ЗамещаемыйСотрудник",СтрокаНЗ.ИсходныйИсполнитель);
		//		Запрос1.УстановитьПараметр("ТекДата",ТекущаяДата());
		//		Выборка1 = Запрос1.Выполнить().Выбрать();
		//		Если Выборка1.Следующий()  Тогда
		//			Запись.Согласовано =  Выборка1.ПричинаЗамены ;
		//			Запись.ТекстовыйРезультат =   "Заместитель " + СтрокаНЗ.ДействующийИсполнитель;
		//			Запись.ПричинаПереадресации  =  Выборка1.ПричинаЗамены;
		//		Иначе
		//			Запись.Согласовано =  "Переадресовано";
		//			Запись.ТекстовыйРезультат =   СтрокаНЗ.ДействующийИсполнитель;
		//			Запись.ПричинаПереадресации  =  "Перенаправлено исполнителем " + СтрокаНЗ.ИсходныйИсполнитель;
		//		КонецЕсли;
		//		//
		//		Запись = Нз.Добавить();	
		//		Запись.БизнесПроцесс =  СтрокаНЗ.БизнесПроцесс;
		//		Запись.Документ = СписокОбъектов[0].Значение;
		//		Запись.Исполнитель = СтрокаНЗ.ДействующийИсполнитель;
		//		Запись.Инициатор   =  СтрокаНЗ.БизнесПроцесс.Автор;
		//		Запись.Порядок = 99;
		//		Запись.Переадресант  = Неопределено;
		//		Запись.Согласовано =  "Не выдана" ;
		//		Запись.ТекстовыйРезультат =   "Не выдана";
		//		Запись.ПричинаПереадресации  = "Не выдана";
		//	КонецЦикла; 
		//КонецЕсли; 
		
		//Запись = Нз.Добавить();	
		//
		//Запись.БизнесПроцесс =  СтрокаНЗ.БизнесПроцесс;
		//
		//Запись.Документ = СписокОбъектов[0].Значение;
		//
		//Запись.Задача = Неопределено;
		//
		//Запись.Исполнитель = СтрокаНЗ.ИсходныйИсполнитель;
		//
		//Если  СписокОбъектов[0].Значение.КонтрагентыДоговоры.Количество() > 0 Тогда
		//	
		//	Запись.ДоговорКонтрагента =  СписокОбъектов[0].Значение.КонтрагентыДоговоры[0].ДоговорКонтрагента;
		//	
		//	Запись.Контрагент  =  СписокОбъектов[0].Значение.КонтрагентыДоговоры[0].Контрагент;
		//	
		//КонецЕсли; 
		//
		//Если  СписокОбъектов[0].Значение.ОрганизацииПодразделения.Количество() > 0 Тогда
		//	
		//	Запись.Подразделение  = СписокОбъектов[0].Значение.ОрганизацииПодразделения[0].Подразделение;
		//	
		//КонецЕсли; 
		//
		//Запись.Сумма =  СписокОбъектов[0].Значение.СуммаДокумента;
		//
		//Запись.Инициатор   =  СтрокаНЗ.БизнесПроцесс.Автор;
		//
		//Запись.Выполнена = Ложь;
		//
		//Запись.Переадресант  = СтрокаНЗ.ДействующийИсполнитель;
		//
		//Запрос1 = Новый Запрос;
		//Запрос1.Текст = "ВЫБРАТЬ
		//|	аДокументооборотМатрицаЗаместителейСрезПоследних.ПричинаЗамены
		//|ИЗ
		//|	РегистрСведений.аДокументооборотМатрицаЗаместителей.СрезПоследних КАК аДокументооборотМатрицаЗаместителейСрезПоследних
		//|ГДЕ
		//|	аДокументооборотМатрицаЗаместителейСрезПоследних.ЗамещаемыйСотрудник = &ЗамещаемыйСотрудник
		//|	И аДокументооборотМатрицаЗаместителейСрезПоследних.ДатаОкончания >= &ТекДата
		//|	И аДокументооборотМатрицаЗаместителейСрезПоследних.Период <= &ТекДата";
		//Запрос1.УстановитьПараметр("ЗамещаемыйСотрудник",СтрокаНЗ.ИсходныйИсполнитель);
		//Запрос1.УстановитьПараметр("ТекДата",ТекущаяДата());
		//Выборка1 = Запрос1.Выполнить().Выбрать();
		//Если Выборка1.Следующий()  Тогда
		//	Запись.Согласовано =  Выборка1.ПричинаЗамены ;
		//	Запись.ТекстовыйРезультат =   "Заместитель " + СтрокаНЗ.ДействующийИсполнитель;
		//	Запись.ПричинаПереадресации  =  Выборка1.ПричинаЗамены;
		//Иначе
		//	Запись.Согласовано =  "Переадресовано";
		//	Запись.ТекстовыйРезультат =   СтрокаНЗ.ДействующийИсполнитель;
		//	Запись.ПричинаПереадресации  =  "Перенаправлено исполнителем " + СтрокаНЗ.ИсходныйИсполнитель;
		//КонецЕсли;
		НЗ.Записать(Истина);
		//СтрокаНЗ.ТочкаКБП	Согласование рецензентами	СправочникСсылка.аДокументооборотТочкиКорпоративныхПроцессов
	КонецЦикла; 
	

КонецПроцедуры
