
&После("ПриЗаписи")
Процедура Pcru_ПриЗаписи(Отказ)
	#Область  _1
	Если ЭтотОбъект.Стартован Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	аДокументооборотСсылкиПроцессов.Объект
		|ИЗ
		|	РегистрСведений.аДокументооборотСсылкиПроцессов КАК аДокументооборотСсылкиПроцессов
		|ГДЕ
		|	аДокументооборотСсылкиПроцессов.БизнесПроцесс = &БизнесПроцесс";
		Запрос.УстановитьПараметр("БизнесПроцесс",ЭтотОбъект.Ссылка );
		Выборка = Запрос.Выполнить().Выбрать();
		СписокОбъектов = Новый  СписокЗначений;
		Пока Выборка.Следующий() Цикл
			СписокОбъектов.Добавить(Выборка.Объект);
		КонецЦикла;
		СсылкаНаПроцесс  = ЭтотОбъект.Ссылка;    
		Если СписокОбъектов.Количество() =0 Тогда
			Возврат;
		КонецЕсли; 
		
		Попытка
			НЗ = РегистрыСведений.pcru_ЗадачиПоДокументам.СоздатьНаборЗаписей();
			НЗ.Отбор.Документ.Установить(СписокОбъектов[0].Значение, Истина);
			НЗ.Прочитать();
		Исключение
			Возврат;
		КонецПопытки;
		Если НЗ.Количество() = 0 Тогда
		Иначе	
			Индекс = 0;
			Для каждого Запись  Из НЗ Цикл
				Запись.БизнесПроцесс = СсылкаНаПроцесс;
				Запись.Согласовано = "Не выдано";
				Запись.ТекстовыйРезультат = "Не выдано";
			КонецЦикла; 
		КонецЕсли; 
		НЗ.Записать(Истина);
		
		 Попытка
			НЗ = РегистрыСведений.pcru_ИсполнителиПоДокументам.СоздатьНаборЗаписей();
			НЗ.Отбор.Документ.Установить(СписокОбъектов[0].Значение, Истина);
			НЗ.Прочитать();
		Исключение
			Возврат;
		КонецПопытки;
		Если НЗ.Количество() = 0 Тогда
		Иначе	
			Индекс = 0;
			Для каждого Запись  Из НЗ Цикл
				Запись.БизнесПроцесс = СсылкаНаПроцесс;
				Запись.Согласовано = "Не выдано";
				Запись.ТекстовыйРезультат = "Не выдано";
			КонецЦикла; 
		КонецЕсли; 
		НЗ.Записать(Истина);
	КонецЕсли; 
	
	Если ЭтотОбъект.Завершен Тогда
		Попытка
			НЗ = РегистрыСведений.pcru_ЗадачиПоДокументам.СоздатьНаборЗаписей();
			НЗ.Отбор.БизнесПроцесс.Установить(ЭтотОбъект.Ссылка, Истина);
			НЗ.Прочитать();
			НЗ.Очистить();
			НЗ.Записать(Истина);
		Исключение
		КонецПопытки;
		
		
		Попытка
			НЗ = РегистрыСведений.pcru_ИсполнителиПоДокументам.СоздатьНаборЗаписей();
			НЗ.Отбор.БизнесПроцесс.Установить(ЭтотОбъект.Ссылка, Истина);
			НЗ.Прочитать();
			НЗ.Очистить();
			НЗ.Записать(Истина);
		Исключение
		КонецПопытки;
	КонецЕсли; 	
	
	
	
	
	
	#КонецОбласти
	
КонецПроцедуры
