
&Вместо("ПриСозданииВерсииОбъекта")
Процедура Pcru_ПриСозданииВерсииОбъекта(Объект)
	Перем НомерПоследнейВерсии, Комментарий;
	
	Если НЕ ОбъектВерсионируется(Объект, НомерПоследнейВерсии) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Объект.ДополнительныеСвойства.Свойство("ВерсионированиеОбъектовКомментарийКВерсии", Комментарий) Тогда
		Комментарий = "";
	КонецЕсли;
	
	СведенияОВерсииОбъекта = Новый Структура;
	СведенияОВерсииОбъекта.Вставить("НомерВерсии", Число(НомерПоследнейВерсии) + 1);
	СведенияОВерсииОбъекта.Вставить("Комментарий", Комментарий);
	
	СоздатьВерсиюОбъекта(Объект, СведенияОВерсииОбъекта);

КонецПроцедуры
