
&НаКлиенте
Процедура Pcru_СписокЗадачВыборВместо(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	
	СтрокаТЧ=Элемент.ТекущиеДанные;
	Если СтрокаТЧ=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрокаТЧ.Свойство("ГруппировкаСтроки") Тогда
		Если СтрокаТЧ.ГруппировкаСтроки<>Неопределено Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли; 
	
	
	ПоказатьЗначение(Неопределено, Элемент.ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура Pcru_СписокЗадачПриАктивизацииСтрокиВместо(Элемент)
	
	СтрокаИсполнителя=Элементы.СписокЗадач.ТекущиеДанные;
	
	Если НЕ Объект.Стартован ИЛИ СтрокаИсполнителя=Неопределено Тогда
		Возврат;
		
	КонецЕсли;
	
	Если СтрокаИсполнителя.РодительскаяГруппировкаСтроки<>Неопределено Тогда
		//это группировка данных строки
		ИсполнительТекущиеДанныеВыполненыеЗадачи="";
		ИсполнительАдресФотографииВыполненыеЗадачи="";
		Возврат;
		
	КонецЕсли;
	
	УстановитьДанныеПользователяВыполенныеЗадачи(СтрокаИсполнителя);

КонецПроцедуры
