// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ОтправкаПочты(Получатель,Тема,Текст) Экспорт
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	Профиль.АдресСервераSMTP = "ruspbpweb01";
	Профиль.ПользовательSMTP = "1c.report@profi-credit.ru";
	Профиль.ПарольSMTP = "";
	Профиль.ИспользоватьSSLSMTP = false;
	Профиль.ПортSMTP = 25; 
	Профиль.АутентификацияSMTP = СпособSMTPАутентификации.БезАутентификации;
	Письмо = Новый ИнтернетПочтовоеСообщение;
	Текст1 = Письмо.Тексты.Добавить(Текст);
	Текст1.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
	Письмо.Тема = Тема; 
	Письмо.Отправитель = "1c.report@profi-credit.ru";
	Письмо.ИмяОтправителя = "Сообщение от 1с";
	Если ТипЗнч(ПОлучатель) = Тип("Строка") Тогда
		Письмо.Получатели.Добавить(Получатель);
	КонецЕсли;  
	Если ТипЗнч(ПОлучатель) = Тип("Массив") Тогда
		Для Каждого Элемент Из ПОлучатель Цикл
			Письмо.Получатели.Добавить(Элемент); 
		КонецЦикла;
	КонецЕсли;  
	//
	Если ТипЗнч(ПОлучатель) = Тип("СправочникСсылка.Пользователи") Тогда
		Для Каждого КИ Из ПОлучатель.КонтактнаяИнформация Цикл
			Если КИ.Тип  = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
				Письмо.Получатели.Добавить(КИ.Представление);	
			КонецЕсли; 	
		КонецЦикла;
	КонецЕсли;  
	//	Письмо.Получатели.Добавить("Aleksander.Sevryugin@profi-credit.ru");
	Почта = Новый ИнтернетПочта;     
	Попытка
		Почта.Подключиться(Профиль);
//		Сообщить("Подключено");
	Исключение
		Сообщить("Не удалось подключиться к серверу");
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	Попытка
		Почта.Послать(Письмо);
//		Сообщить("Письмо отправлено");
	Исключение
		Сообщить("Не удалось отправить письмо");
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	Почта.Отключиться();
//	Сообщить("Соединение завершено");
КонецПроцедуры // ОтправкаПочты()

Процедура ОтправкаПочтыСтандарт(Тема,Текст) Экспорт
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	Профиль.АдресСервераSMTP = "ruspbpweb01";
	Профиль.ПользовательSMTP = "1c.report@profi-credit.ru";
	Профиль.ПарольSMTP = "";
	Профиль.ИспользоватьSSLSMTP = false;
	Профиль.ПортSMTP = 25; 
	Профиль.АутентификацияSMTP = СпособSMTPАутентификации.БезАутентификации;
	
	Письмо = Новый ИнтернетПочтовоеСообщение;
	Текст1 = Письмо.Тексты.Добавить(Текст);
	Текст1.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
	Письмо.Тема = Тема; 
	Письмо.Отправитель = "1c.report@profi-credit.ru";
	Письмо.ИмяОтправителя = "Сообщение от 1с";
	Письмо.Получатели.Добавить("Aleksander.Sevryugin@profi-credit.ru");
	
	Почта = Новый ИнтернетПочта;     
	Попытка
		Почта.Подключиться(Профиль);
		Сообщить("Подключено");
	Исключение
		Сообщить("Не удалось подключиться к серверу");
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	Попытка
		Почта.Послать(Письмо);
		Сообщить("Письмо отправлено");
	Исключение
		Сообщить("Не удалось отправить письмо");
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	Почта.Отключиться();
	Сообщить("Соединение завершено");
	
	
	
КонецПроцедуры // ОтправкаПочты()


Функция Сообщить_об_ошибке(Текст) Экспорт
	ОтправкаПочтыСтандарт("Ошибка",Текст);
КонецФункции // ()
